lab11_ci/ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title  = 'Daftar Artikel';
        $q      = $this->request->getVar('q') ?? '';
        $model  = new ArtikelModel();
        $data   =
        [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->paginate(10), #data dibatasi 10 record per halaman
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `artikel`
SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`

    public function edit($id)
    {
        $artikel = new ArtikelModel();

        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid)
        {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');

            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'gambar'=> $file->getName(),
            ]);
            return redirect('admin/artikel');
        }

        // ambil data lama
        $data = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id)
    {
        $artikel = new ArtikelModel();
        $artikel->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('2')